# pandas function

In [3]:
import pandas as pd

csv_1 = pd.read_csv("C:\\Users\\Aditya\\OneDrive\\Desktop\\demo1.csv")

print(csv_1)

      Name      Course   Fees   Address
0   Aditya    Computer  75000   Bhandup
1  Pranita  Electrical  40000     Parel
2     Evan       Civil  30000     Dadar
3     Kris   Computer   75000   Matunga
4   Hritik       Civil  30000     Thane
5      Sam  Electrical  40000   Dahisar
6    Rajes    Computer  75000     Kurla
7   Aditya       Civil  30000  Borivali
8     Kris  Electrical  40000     Dadar
9     Evan    Computer  75000    Bandra

In [4]:
csv_1.index

RangeIndex(start=0, stop=10, step=1)

In [7]:
csv_1.columns

Index(['Name', 'Course', 'Fees', 'Address'], dtype='object')

In [8]:
csv_1.describe

<bound method NDFrame.describe of       Name      Course   Fees   Address
0   Aditya    Computer  75000   Bhandup
1  Pranita  Electrical  40000     Parel
2     Evan       Civil  30000     Dadar
3     Kris   Computer   75000   Matunga
4   Hritik       Civil  30000     Thane
5      Sam  Electrical  40000   Dahisar
6    Rajes    Computer  75000     Kurla
7   Aditya       Civil  30000  Borivali
8     Kris  Electrical  40000     Dadar
9     Evan    Computer  75000    Bandra>

In [9]:
csv_1.head(5)

      Name      Course   Fees  Address
0   Aditya    Computer  75000  Bhandup
1  Pranita  Electrical  40000    Parel
2     Evan       Civil  30000    Dadar
3     Kris   Computer   75000  Matunga
4   Hritik       Civil  30000    Thane

In [11]:
csv_1.tail(2)

   Name      Course   Fees Address
8  Kris  Electrical  40000   Dadar
9  Evan    Computer  75000  Bandra

In [15]:
csv_1[2:5]

     Name     Course   Fees  Address
2    Evan      Civil  30000    Dadar
3    Kris  Computer   75000  Matunga
4  Hritik      Civil  30000    Thane

In [16]:
print(type(csv_1))

<class 'pandas.core.frame.DataFrame'>

In [17]:
csv_1.index.array

<NumpyExtensionArray>
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
Length: 10, dtype: int64

In [18]:
csv_1.to_numpy()

array([['Aditya', 'Computer', 75000, 'Bhandup'],
       ['Pranita', 'Electrical', 40000, 'Parel'],
       ['Evan', 'Civil', 30000, 'Dadar'],
       ['Kris', 'Computer ', 75000, 'Matunga'],
       ['Hritik', 'Civil', 30000, 'Thane'],
       ['Sam', 'Electrical', 40000, 'Dahisar'],
       ['Rajes', 'Computer', 75000, 'Kurla'],
       ['Aditya', 'Civil', 30000, 'Borivali'],
       ['Kris', 'Electrical', 40000, 'Dadar'],
       ['Evan', 'Computer', 75000, 'Bandra']], dtype=object)

In [20]:
import numpy as np

v = np.asarray(csv_1)

print(v)

[['Aditya' 'Computer' 75000 'Bhandup']
 ['Pranita' 'Electrical' 40000 'Parel']
 ['Evan' 'Civil' 30000 'Dadar']
 ['Kris' 'Computer ' 75000 'Matunga']
 ['Hritik' 'Civil' 30000 'Thane']
 ['Sam' 'Electrical' 40000 'Dahisar']
 ['Rajes' 'Computer' 75000 'Kurla']
 ['Aditya' 'Civil' 30000 'Borivali']
 ['Kris' 'Electrical' 40000 'Dadar']
 ['Evan' 'Computer' 75000 'Bandra']]

In [21]:
csv_1.sort_index(axis=0, ascending=False)

      Name      Course   Fees   Address
9     Evan    Computer  75000    Bandra
8     Kris  Electrical  40000     Dadar
7   Aditya       Civil  30000  Borivali
6    Rajes    Computer  75000     Kurla
5      Sam  Electrical  40000   Dahisar
4   Hritik       Civil  30000     Thane
3     Kris   Computer   75000   Matunga
2     Evan       Civil  30000     Dadar
1  Pranita  Electrical  40000     Parel
0   Aditya    Computer  75000   Bhandup

In [24]:
csv_1.loc[0,"Name"] = "Adi"
csv_1

      Name      Course   Fees   Address
0      Adi    Computer  75000   Bhandup
1  Pranita  Electrical  40000     Parel
2     Evan       Civil  30000     Dadar
3     Kris   Computer   75000   Matunga
4   Hritik       Civil  30000     Thane
5      Sam  Electrical  40000   Dahisar
6    Rajes    Computer  75000     Kurla
7   Aditya       Civil  30000  Borivali
8     Kris  Electrical  40000     Dadar
9     Evan    Computer  75000    Bandra

In [30]:
csv_1.loc[[2,3],["Name","Address"]]

   Name  Address
2  Evan    Dadar
3  Kris  Matunga

In [32]:
csv_1.iloc[0,2]

75000

In [33]:
csv_1.drop("Course", axis=1)

      Name   Fees   Address
0      Adi  75000   Bhandup
1  Pranita  40000     Parel
2     Evan  30000     Dadar
3     Kris  75000   Matunga
4   Hritik  30000     Thane
5      Sam  40000   Dahisar
6    Rajes  75000     Kurla
7   Aditya  30000  Borivali
8     Kris  40000     Dadar
9     Evan  75000    Bandra

In [34]:
csv_1.drop(0, axis=0)

      Name      Course   Fees   Address
1  Pranita  Electrical  40000     Parel
2     Evan       Civil  30000     Dadar
3     Kris   Computer   75000   Matunga
4   Hritik       Civil  30000     Thane
5      Sam  Electrical  40000   Dahisar
6    Rajes    Computer  75000     Kurla
7   Aditya       Civil  30000  Borivali
8     Kris  Electrical  40000     Dadar
9     Evan    Computer  75000    Bandra